import type { Constellation } from "../types/background.types";
// Орион (Orion)

// Большая Медведица (Большой Ковш, Ursa Major)

// Малая Медведица (Малый Ковш, Полярная звезда, Ursa Minor)

// Кассиопея (Cassiopeia)

// Скорпион (Scorpius)

// Лев (Leo)

// Телец (с Плеядами, Taurus)

// Близнецы (Gemini)

// Пегас (Pegasus)

// Лебедь (Cygnus)

// Стрелец (Sagittarius)

// Андромеда (Andromeda)
export const constellationsData: Constellation[] = [
  {
    name: "Orion",
    stars: [
      { x: 50, y: 50 },
      { x: 70, y: 55 },
      { x: 45, y: 70 },
      { x: 65, y: 65 },
      { x: 50, y: 90 },
      { x: 65, y: 115 },
      { x: 95, y: 100 },
      { x: 105, y: 120 },
      { x: 145, y: 120 },
      { x: 147, y: 110 },
      { x: 140, y: 95 },
      { x: 142, y: 125 },
      { x: 140, y: 140 },
      { x: 132, y: 150 },
      { x: 80, y: 170 },
      { x: 90, y: 166 },
      { x: 100, y: 162 },
      { x: 73, y: 200 },
      { x: 110, y: 196 },
    ],
    lines: [
      [0, 2],
      [1, 3],
      [3, 4],
      [2, 4],
      [4, 5],
      [5, 6],
      [6, 7],
      [7, 8],
      [8, 9],
      [9, 10],
      [8, 11],
      [11, 12],
      [12, 13],
      [7, 16],
      [16, 15],
      [15, 14],
      [5, 14],
      [14, 17],
      [16, 18],
      [17, 18],
    ],
    vx: Math.random() * 0.1,
    vy: Math.random() * 0.1,
  },
  {
    name: "Ursa Major",
    stars: [
      { x: 190, y: 400 },
      { x: 218, y: 390 },
      { x: 230, y: 393 },
      { x: 248, y: 396 },
      { x: 290, y: 375 },
      { x: 300, y: 399 },
      { x: 260, y: 415 },
    ],
    lines: [
      [0, 1],
      [1, 2],
      [2, 3],
      [3, 4],
      [4, 5],
      [5, 6],
      [6, 3],
    ],
    vx: Math.random() * 0.1,
    vy: Math.random() * 0.1,
  },
];
